[
  {
    "name": "Macbook",
    "searchName": "macbook",
    "shortDescription": "A near-replica of the MacBook interface, showcasing apps like Photos and Notes.",
    "detailedDescription": "This project provides an immersive challenge by simulating a MacBook interface entirely through HTML, CSS, and JavaScript. It includes fully interactive applications like Photos, Notes, Safari, and Settings, each designed to mimic their real-world counterparts. Users will dive deep into creating responsive layouts using advanced CSS techniques like flexbox and grid. Additionally, this project involves state management for individual apps, enabling dynamic content rendering and smooth animations. By building this interface, users will strengthen their understanding of creating modular, scalable code and mastering event handling to produce a seamless user experience. This is an ideal challenge for those seeking to build complex, real-world user interfaces.",
    "languages": ["HTML", "CSS", "JavaScript"],
    "image": "../assets/challenges/challenge-one.png",
    "GitHub": "https://github.com/FESOO1/Macbook",
    "liveWebsite": "https://macbook-bice.vercel.app/",
    "HTMLLink": "../pages/show-challenge.html",
    "difficulty": "Hard"
  },
  {
    "name": "Flip Match",
    "searchName": "flip-match",
    "shortDescription": "A memory-matching card game with a simple and interactive design.",
    "detailedDescription": "Flip Match is a fun and interactive memory game designed to improve JavaScript logic and problem-solving skills. The challenge involves implementing game mechanics such as shuffling cards, tracking player moves, and checking for matching pairs. Users will gain hands-on experience with DOM manipulation to dynamically update the game board and display animations. This project also requires managing game state, such as resetting the game or handling end-of-game scenarios, providing an excellent opportunity to learn event-driven programming. Moreover, users will explore CSS animations and transitions to create a visually engaging user experience, while improving their ability to write clean, maintainable code.",
    "languages": ["HTML", "CSS", "JavaScript"],
    "image": "../assets/challenges/challenge-two.png",
    "GitHub": "https://github.com/FESOO1/Flip-Match",
    "liveWebsite": "https://flip-match.vercel.app/",
    "HTMLLink": "../pages/show-challenge.html",
    "difficulty": "Medium"
  },
  {
    "name": "Flashcard App",
    "searchName": "flashcard",
    "shortDescription": "A study tool for creating and reviewing flashcards.",
    "detailedDescription": "The Flashcard App project is perfect for users looking to build dynamic, data-driven web applications. It involves creating an interface where users can add, edit, and delete flashcards, enabling a personalized study experience. This project focuses on managing user input and storing data locally using JavaScript’s localStorage API, which allows users to retain their flashcards even after refreshing the page. Users will also learn about CRUD operations and develop responsive designs to ensure a seamless experience across devices. By completing this challenge, developers will enhance their problem-solving skills and understand how to structure applications that handle dynamic content efficiently.",
    "languages": ["HTML", "CSS", "JavaScript"],
    "image": "../assets/challenges/challenge-three.png",
    "GitHub": "https://github.com/FESOO1/Flashcard-App",
    "liveWebsite": "https://flashcard-app-delta-silk.vercel.app/",
    "HTMLLink": "../pages/show-challenge.html",
    "difficulty": "Medium"
  },
  {
    "name": "Password Generator",
    "searchName": "password-generator",
    "shortDescription": "A tool to create secure, customizable passwords.",
    "detailedDescription": "The Password Generator project is an essential tool for learning how to build practical web applications that enhance security. It involves creating an interface where users can customize their password settings, such as length and character types, to generate strong, unique passwords. This challenge focuses on implementing JavaScript functions for random character selection, ensuring the generated passwords meet user-defined criteria. Users will also work on validating input fields and providing real-time feedback to enhance usability. Additionally, the project emphasizes creating a clean and responsive design, making it an excellent exercise for improving both functionality and user experience in web development.",
    "languages": ["HTML", "CSS", "JavaScript"],
    "image": "../assets/challenges/challenge-four.png",
    "GitHub": "https://github.com/FESOO1/Password-Generator",
    "liveWebsite": "https://password-generator-eight-theta-28.vercel.app/",
    "HTMLLink": "../pages/show-challenge.html",
    "difficulty": "Easy"
  }
]